things-cloud/modbus-implementaion-cc3200/main.c
#include <string.h>

// SimpleLink includes
#include "simplelink.h"

// driverlib includes
#include "hw_memmap.h"
#include "hw_common_reg.h"


#include "hw_ints.h"
#include "hw_types.h"
#include "hw_uart.h"
#include "hw_wdt.h"
#include "rom.h"
#include "wdt.h"
#include "rom_map.h"
#include "pin.h"
#include "prcm.h"
#include "gpio.h"
#include "utils.h"
#include "interrupt.h"
#include "udma.h"
#include "json.h"
#include "timer.h"
// common interface includes
#include "uart_if.h"
#include "udma_if.h"
#include "timer_if.h"
#include "WDT_if.h"
#include "uart.h"
#include "common.h"
#include "pinmux.h"
#include "gpio_if.h"
// HTTP Client lib
#include <http/client/httpcli.h>
#include <http/client/common.h>

//pnarasim
#include "netcfg.h"

// JSON Parser
#include "jsmn.h"
//#define WATCHDOG
#define APPLICATION_VERSION             "1.1.1"
#define APP_NAME                        "The ThingsCloud"
#define WD_PERIOD_MS                    20000
#define MAP_SysCtlClockGet              80000000
#define MILLISECONDS_TO_TICKS(ms)       ((MAP_SysCtlClockGet / 1000) * (ms))


#define BAUD_RATE                       19200


#define SH_GPIO_3                       3

#define POST_REQUEST_URI_AC            "/devices/deviceData"
#define POST_REQUEST_URI_DC            "/devices/deviceData"

#define POST_HEADER                     "{"
#define POST_timestamp                           "\n\"dts\":"
#define POST_DEVICEID                           ",\n\"device_id\":201840,"
#define POST_SLAVE                              "\n\"slave_id\":1"


#define POST_HEADER1                    ",\n\"data\":"
#define POST_BEGIN                              "{"

#define POST_END                                "\n}"

#define POST_TAIL1                              "\n}"

#define LOGIN                           1
#define TIME                            2
#define POST                            3

#define Debug    1
#define Slave    2


#define PUT_REQUEST_URI                 "/put"
#define PUT_DATA                        "PUT request."

#define GET_REQUEST_URI                 "/api/timestamp"


#define HOST_PORT                       80
#define TIME_PORT                       80

#define PROXY_IP                         <proxy_ip>
#define PROXY_PORT                       <proxy_port>

#define READ_SIZE                       1450
#define MAX_BUFF_SIZE                   1460

#define TX_EN  MAP_GPIOPinWrite(GPIOA2_BASE,GPIO_PIN_6,GPIO_PIN_6)
#define TX_DIS   MAP_GPIOPinWrite(GPIOA2_BASE,GPIO_PIN_6,0)

#define RX_DIS   MAP_GPIOPinWrite(GPIOA1_BASE,GPIO_PIN_6,GPIO_PIN_6)
#define RX_EN   MAP_GPIOPinWrite(GPIOA1_BASE,GPIO_PIN_6,0)


// Application specific status/error codes
typedef enum{
/* Choosing this number to avoid overlap with host-driver's error codes */
DEVICE_NOT_IN_STATION_MODE = -0x7D0,
DEVICE_START_FAILED = DEVICE_NOT_IN_STATION_MODE - 1,
INVALID_HEX_STRING = DEVICE_START_FAILED - 1,
TCP_RECV_ERROR = INVALID_HEX_STRING - 1,
TCP_SEND_ERROR = TCP_RECV_ERROR - 1,
FILE_NOT_FOUND_ERROR = TCP_SEND_ERROR - 1,
INVALID_SERVER_RESPONSE = FILE_NOT_FOUND_ERROR - 1,
FORMAT_NOT_SUPPORTED = INVALID_SERVER_RESPONSE - 1,
FILE_OPEN_FAILED = FORMAT_NOT_SUPPORTED - 1,
FILE_WRITE_ERROR = FILE_OPEN_FAILED - 1,
INVALID_FILE = FILE_WRITE_ERROR - 1,
SERVER_CONNECTION_FAILED = INVALID_FILE - 1,
GET_HOST_IP_FAILED = SERVER_CONNECTION_FAILED  - 1,

STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long  g_ulStatus = 0;//SimpleLink Status
unsigned long  g_ulDestinationIP; // IP address of destination server
unsigned long  g_ulGatewayIP = 0; //Network Gateway IP address
unsigned char  g_ucConnectionSSID[SSID_LEN_MAX+1]; //Connection SSID
unsigned char  g_ucConnectionBSSID[BSSID_LEN_MAX]; //Connection BSSID
static unsigned int g_uiDeviceModeConfig;
unsigned long  g_ulStaIp = 0;
unsigned char g_buff[MAX_BUFF_SIZE+1];
const char *soft_layer = "api.thingsio.ai"; //"<host name>"
//const char *soft_layer = "netracollab.ntpc.co.in";
const char *Time_server = "baas.thethingscloud.com"; //"<host name>"
char slave_str[4];
bool g_logged_in = false,proceed = false;
bool critiacl_section = false;

const int Adress[12] = {30001, 30002};

int temp_index;

const char*name_list[2] = {
		"temp","motion"
};

//const char *Time_server = "198.211.122.7"; //"<host name>"
char Query_set[8];
long bytesReceived = 0; // variable to store the file size
char ses_id[500],recv_buffer[20];
char post_data[1000];
char timestamp[10];
char no_of_slaves;
char Post_string_size[4];

int uartRxLength,s=0;
int result;
char slave_list[256];
char instance=0;
long uint_count;
#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************
void uart_init();
void WlanAPMode();

//*****************************************************************************
// SimpleLink Asynchronous Event Handlers -- Start
//*****************************************************************************
static Mesage(unsigned char *m)
{
    UDMASetupTransfer(UDMA_CH9_UARTA0_TX,
                        UDMA_MODE_BASIC,
                        8,
                        UDMA_SIZE_8,
                        UDMA_ARB_8,
                        (void *)m,
                        UDMA_SRC_INC_8,
                        (void *)(UARTA0_BASE+UART_O_DR),
                        UDMA_DST_INC_NONE);

//
// Enable TX DMA request
//
MAP_UARTDMAEnable(UARTA0_BASE,UART_DMA_TX);

}

static inline void HIBEntrePreamble()
{
    HWREG(0x400F70B8) = 1;
    UtilsDelay(800000/5);
    HWREG(0x400F70B0) = 1;
    UtilsDelay(800000/5);

    HWREG(0x4402E16C) |= 0x2;
    UtilsDelay(800);
    HWREG(0x4402F024) &= 0xF7FFFFFF;
}
//*****************************************************************************
//
//! \brief The Function Handles WLAN Events
//!
//! \param[in]  pWlanEvent - Pointer to WLAN Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pWlanEvent)
{
    switch(pWlanEvent->Event)
    {
        case SL_WLAN_CONNECT_EVENT:
            {
                SET_STATUS_BIT(g_ulStatus, STATUS_BIT_CONNECTION);

//
// Information about the connected AP (like name, MAC etc) will be
// available in 'slWlanConnectAsyncResponse_t'-Applications
// can use it if required

// Copy new connection SSID and BSSID to global parameters
        memcpy(g_ucConnectionSSID,pWlanEvent->EventData.
        STAandP2PModeWlanConnected.ssid_name,
        pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len);
        memcpy(g_ucConnectionBSSID,
        pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
        SL_BSSID_LENGTH);
            }
            break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t*  pEventData = NULL;

