things-cloud/modbus-implementaion-cc3200/main.c
//*****************************************************************************//

static int ConfigureMode(int iMode)
{

    long   lRetVal = -1;

    lRetVal = sl_WlanSetMode(iMode);
    ASSERT_ON_ERROR(lRetVal);



    //Mesage("Device is configured in AP mode\n\r");

    /* Restart Network processor */
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);

    // reset status bits
    CLR_STATUS_BIT_ALL(g_ulStatus);

    return sl_Start(NULL,NULL,NULL);
}
//*******************************************************************************//
//*****************************************************************************
//! \brief This function puts the device in its default state. It:
//!           - Set the mode to STATION
//!           - Configures connection policy to Auto and AutoSmartConfig
//!           - Deletes all the stored profiles
//!           - Enables DHCP
//!           - Disables Scan policy
//!           - Sets Tx power to maximum
//!           - Sets power policy to normal
//!           - Unregister mDNS services
//!           - Remove all filters
//!
//! \param   none
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static long ConfigureSimpleLinkToDefaultState()
{
    SlVersionFull   ver = {0};
          _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};

          unsigned char ucVal = 1;
          unsigned char ucConfigOpt = 0;
          unsigned char ucConfigLen = 0;
          unsigned char ucPower = 0;

          long lRetVal = -1;
          long lMode = -1;


          lMode = sl_Start(0, 0, 0);
          ASSERT_ON_ERROR(lMode);
          sl_WlanPolicySet(SL_POLICY_CONNECTION,SL_CONNECTION_POLICY(1,0,0,0,1),NULL,0);
          if(ROLE_STA != lRetVal && g_uiDeviceModeConfig == ROLE_STA )
          {
              if (ROLE_AP == lRetVal)
              {
                  // If the device is in AP mode, we need to wait for this event
                  // before doing anything
                  while(!IS_IP_ACQUIRED(g_ulStatus))
                  {
                  #ifndef SL_PLATFORM_MULTI_THREADED
                    _SlNonOsMainLoopTask();
                  #endif
                  }
              }
              //Switch to STA Mode
              lRetVal = ConfigureMode(ROLE_STA);
              ASSERT_ON_ERROR( lRetVal);
          }
          GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
          //Device is in STA Mode and Force AP Jumper is Connected
          if(ROLE_AP != lRetVal && g_uiDeviceModeConfig == ROLE_AP )
          {
               //Switch to AP Mode
               lRetVal = ConfigureMode(ROLE_AP);
               ASSERT_ON_ERROR( lRetVal);

          }
          // If the device is not in station-mode, try configuring it in station-mode

          // Get the device's version-information
          ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
          ucConfigLen = sizeof(ver);
          lRetVal = sl_DevGet(SL_DEVICE_GENERAL_CONFIGURATION, &ucConfigOpt,
                                      &ucConfigLen, (unsigned char *)(&ver));
          ASSERT_ON_ERROR(lRetVal);

          UART_PRINT("Host Driver Version: %s\n\r",SL_DRIVER_VERSION);
          UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r",
          ver.NwpVersion[0],ver.NwpVersion[1],ver.NwpVersion[2],ver.NwpVersion[3],
          ver.ChipFwAndPhyVersion.FwVersion[0],ver.ChipFwAndPhyVersion.FwVersion[1],
          ver.ChipFwAndPhyVersion.FwVersion[2],ver.ChipFwAndPhyVersion.FwVersion[3],
          ver.ChipFwAndPhyVersion.PhyVersion[0],ver.ChipFwAndPhyVersion.PhyVersion[1],
          ver.ChipFwAndPhyVersion.PhyVersion[2],ver.ChipFwAndPhyVersion.PhyVersion[3]);

          //
          // Device in station-mode. Disconnect previous connection if any
          // The function returns 0 if 'Disconnected done', negative number if already
          // disconnected Wait for 'disconnection' event if 0 is returned, Ignore
          // other return-codes
          //
          GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
          if (g_uiDeviceModeConfig != ROLE_AP)
                  {
          lRetVal = sl_WlanDisconnect();
          if(0 == lRetVal)
          {
              // Wait
              while(IS_CONNECTED(g_ulStatus))
              {
      #ifndef SL_PLATFORM_MULTI_THREADED
                    _SlNonOsMainLoopTask();
      #endif
              }
          }
                  }
          // Enable DHCP client
          lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
          ASSERT_ON_ERROR(lRetVal);
          if (g_uiDeviceModeConfig != ROLE_AP)
          {
          // Disable scan
          ucConfigOpt = SL_SCAN_POLICY(0);
          lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
          ASSERT_ON_ERROR(lRetVal);
          }
          // Set Tx power level for station mode
          // Number between 0-15, as dB offset from max power - 0 will set max power
          ucPower = 0;
          lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
                  WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
          ASSERT_ON_ERROR(lRetVal);

          // Set PM policy to normal
          lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
          ASSERT_ON_ERROR(lRetVal);

          // Unregister mDNS services
          lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
          ASSERT_ON_ERROR(lRetVal);

          // Remove  all 64 filters (8*8)
          memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
          lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
                             sizeof(_WlanRxFilterOperationCommandBuff_t));
          ASSERT_ON_ERROR(lRetVal);
          GPIO_IF_LedToggle(MCU_RED_LED_GPIO);

          lRetVal = sl_Stop(0);
          ASSERT_ON_ERROR(lRetVal);
          if (lRetVal!=0)
          {
              lRetVal = sl_Stop(0);
              ASSERT_ON_ERROR(lRetVal);
          }
          InitializeAppVariables();
          lMode = sl_Start(0, 0, 0);
          ASSERT_ON_ERROR(lMode);

          return SUCCESS;
}




//****************************************************************************
//
//! \brief Connecting to a WLAN Accesspoint
//!
//!  This function connects to the required AP (SSID_NAME) with Security
//!  parameters specified in te form of macros at the top of this file
//!
//! \param  Status value
//!
//! \return  None
//!
//! \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect()
{

