things-cloud/modbus-implementaion-cc3200/main.c
// Wait for WLAN Event
    UART_PRINT("Awaiting an AP connection...");
                while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
                {
                    // wait till connects to an AP
                    GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
                    _SlNonOsMainLoopTask();
                    delay(5000);
                }
    GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    UART_PRINT("connected to an AP\n");
    return SUCCESS;

}

void WlanAPMode(  )
{

    unsigned char ucDHCP;
    long lRetVal = -1;

    InitializeAppVariables();

    //
    // Following function configure the device to default state by cleaning
    // the persistent settings stored in NVMEM (viz. connection profiles &
    // policies, power policy etc)
    //
    // Applications may choose to skip this step if the developer is sure
    // that the device is in its default state at start of applicaton
    //
    // Note that all profiles and persistent settings that were done on the
    // device will be lost
    //
    lRetVal = ConfigureSimpleLinkToDefaultState();
    if(lRetVal < 0)
    {
        if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
        UART_PRINT("Failed to configure the device in its default state \n\r");

        LOOP_FOREVER();
    }

    // UART_PRINT("Device is configured in default state \n\r");

    //
    // Asumption is that the device is configured in station mode already
    // and it is in its default state
    //
    lRetVal = sl_Start(NULL,NULL,NULL);

    if (lRetVal < 0)
    {
        UART_PRINT("Failed to start the device \n\r");
        LOOP_FOREVER();
    }
    //
    // Configure the networking mode and ssid name(for AP mode)
    //
    if(lRetVal != ROLE_AP)
    {
        if(ConfigureMode(lRetVal) != ROLE_AP)
            {
                UART_PRINT("Unable to set AP mode, exiting Application...\n\r");
                    sl_Stop(SL_STOP_TIMEOUT);
                    LOOP_FOREVER();
            }
    }

    while(!IS_IP_ACQUIRED(g_ulStatus))
    {
    //looping till ip is acquired
    }

        unsigned char len = sizeof(SlNetCfgIpV4Args_t);
        SlNetCfgIpV4Args_t ipV4 = {0};

        // get network configuration
        lRetVal = sl_NetCfgGet(SL_IPV4_AP_P2P_GO_GET_INFO,&ucDHCP,&len,
        (unsigned char *)&ipV4);
        if (lRetVal < 0)
        {
            UART_PRINT("Failed to get network configuration \n\r");
            LOOP_FOREVER();
        }

        UART_PRINT("Connect a client to Device\n\r");
        while(!IS_IP_LEASED(g_ulStatus))
        {
        //wating for the client to connect
        }
        UART_PRINT("Client is connected to Device\n\r");
        // Switch off Network processor
        lRetVal = sl_Stop(SL_STOP_TIMEOUT);
        UART_PRINT("WLAN AP example executed successfully");
        while(1);
}




//*****************************************************************************
//
//! \brief Handler for parsing JSON data
//!
//! \param[in]  ptr - Pointer to http response body data
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
int ParseJSONData(char *ptr)
{
    long lRetVal = 0;
    int noOfToken;
    jsmn_parser parser;
    jsmntok_t   *tokenList;


    /* Initialize JSON PArser */
    jsmn_init(&parser);

    /* Get number of JSON token in stream as we we dont know how many tokens need to pass */
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), NULL, 10);
    if(noOfToken <= 0)
        {
            UART_PRINT("Failed to initialize JSON parser\n\r");
            return -1;

        }

    /* Allocate memory to store token */
    tokenList = (jsmntok_t *) malloc(noOfToken*sizeof(jsmntok_t));
    if(tokenList == NULL)
    {
    UART_PRINT("Failed to allocate memory\n\r");
    return -1;
    }

/* Initialize JSON Parser again */
    jsmn_init(&parser);
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), tokenList, noOfToken);
    if(noOfToken < 0)
    {
        UART_PRINT("Failed to parse JSON tokens\n\r");
        lRetVal = noOfToken;
    }
    else
    {
        UART_PRINT("Successfully parsed %ld JSON tokens\n\r", noOfToken);
    }

    free(tokenList);

    return lRetVal;
}

/*!
\brief This function read respose from server and dump on console

\param[in]      httpClient - HTTP Client object

\return         0 on success else -ve

\note

\warning
*/
static int FlushHTTPResponse(HTTPCli_Handle httpClient)
{
        int lRetVal = -1,status;
        char error[15];
        status = HTTPCli_getResponseStatus(httpClient);

        sprintf(error,"post status %d",status);
        UART_PRINT(error);
        UART_PRINT("\n");

        char *respFields[2] = {
                                HTTPCli_FIELD_NAME_CONTENT_LENGTH,
                                NULL
                                };
        char buf[356];
        int len;
        bool moreFlag = 0;

        /* Store previosly store array if any */
        HTTPCli_setResponseFields(httpClient, respFields);

        do {
                // Filter the response headers and get the set response field
                //
                // ...
                // Content-type: text/xml; charset=utf-8\r\n
                // Content-length: 34
                // ...
                lRetVal = HTTPCli_getResponseField(httpClient, buf, sizeof(buf), &moreFlag);

                // process data in buf if field is content length
                // Zero is the index of Content length in respFields array
                if (lRetVal == 0) {
                len = (int)strtoul(buf, NULL, 0);
            }

            //loop till the end of the response fields
            } while (lRetVal != HTTPCli_FIELD_ID_END);
        //UART_PRINT(buf);
        while (len > 0) {
        len -= HTTPCli_readRawResponseBody(httpClient, buf, sizeof(buf));
        // process buf data and save
        }

        UART_PRINT(buf);
        GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
        return 0;

