things-cloud/modbus-implementaion-cc3200/main.c
}
/************************************************************************************************/
/***********************************************************************************************************/


static int readResponse(HTTPCli_Handle httpClient)
{
        long lRetVal = 0;
        int bytesRead = 0;
        int i,j;
        char error[15];
        unsigned long len;

        char *S_id,*P;
        char *dataBuffer = NULL;

        const char *ids[4] = {
                                HTTPCli_FIELD_NAME_CONTENT_LENGTH,
                                HTTPCli_FIELD_NAME_CONNECTION,
                                HTTPCli_FIELD_NAME_CONTENT_TYPE,
                                NULL
                            };
        //JsonNode *jn,*jns;

        /* Read HTTP POST request status code */

          j=0;

        HTTPCli_setResponseFields(httpClient, (const char **)ids);



        switch (instance)
        {
            case TIME:

            	delay(4000);
            	lRetVal = HTTPCli_getResponseStatus(httpClient);
            	                            if(lRetVal==200)
            	                            {
            	                                UART_PRINT("Time status 200\n");
            	                               // GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
            	                            }
            	                            else
            	                            {
            	                                sprintf(error,"Time status %d",lRetVal);
            	                                UART_PRINT(error);
            	                                UART_PRINT("\n");
            	                            }
            	                            len = 2500;
            	                            dataBuffer = calloc(len,sizeof(char));
            	                            bytesRead = HTTPCli_readRawResponseBody(httpClient, (char *)dataBuffer, len);

            	                            dataBuffer[bytesRead] = '\0';
            	                            P = strstr(dataBuffer,"\"timestamp\"");

            	                            for (i=0;i<10;i++)
            	                            {
            	                                timestamp[i]=*(P+12+i);
            	                            }
            	                            UART_PRINT(timestamp);
            	                            break;
            case POST:
                            FlushHTTPResponse(httpClient);
                            break;
        }
        /* treating data as a plain text */

        lRetVal = 0;

            if(len > sizeof(g_buff) && (dataBuffer != NULL))
            {
                UART_PRINT("Freeing allocated databuffer\r\n");
                free(dataBuffer);
            }
        return lRetVal;

}

//*****************************************************************************
//
//! \brief HTTP POST Demonstration
//!
//! \param[in]  httpClient - Pointer to http client
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int HTTPPostMethod(HTTPCli_Handle httpClient, char*post_uri)
{
        bool moreFlags = 1;
        bool lastFlag = 1;
        long lRetVal = 0;
        HTTPCli_Field fields[5] = {
        		{HTTPCli_FIELD_NAME_HOST, soft_layer},
        		                                    {HTTPCli_FIELD_NAME_CONTENT_TYPE, "application/json"},
        		                                    {HTTPCli_FIELD_NAME_AUTHORIZATION,"Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.IjViMjBhN2UyODQ2YjFhNDBiMmIxYTFlZiI.5xoErxmyV5sCc3JYBHwpwXnfH6Mk7S9XVVWqvwDB9Cs"},
        		                                    {NULL, NULL}
                                      };
        /* Set request header fields to be send for HTTP request. */
        HTTPCli_setRequestFields(httpClient, fields);
        /* Send POST method request. */
        /* Here we are setting moreFlags = 1 as there are some more header fields need to send
        other than setted in previous call HTTPCli_setRequestFields() at later stage.
        Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
        */
        moreFlags = 1;
        lRetVal = HTTPCli_sendRequest(httpClient, HTTPCli_METHOD_POST,POST_REQUEST_URI_DC , moreFlags);
        if(lRetVal < 0)
        {
            UART_PRINT("Failed to send HTTP POST request header.\n\r");
            return lRetVal;
        }
        /* Here we are setting lastFlag = 1 as it is last header field.
        Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
        */
        lastFlag = 1;
        lRetVal = HTTPCli_sendField(httpClient, HTTPCli_FIELD_NAME_CONTENT_LENGTH, (const char *)Post_string_size, lastFlag);
        if(lRetVal < 0)
        {
            UART_PRINT("Failed to send HTTP POST request header.\n\r");
            return lRetVal;
        }

        /* Send POST data/body */
        lRetVal = HTTPCli_sendRequestBody(httpClient, post_data, (strlen(post_data)));
        if(lRetVal < 0)
        {
            UART_PRINT("Failed to send HTTP POST request body.\n\r");
            return lRetVal;
        }
        instance = POST;
        lRetVal = readResponse(httpClient);
        return lRetVal;
}

//*****************************************************************************


static int HTTPGetMethod(HTTPCli_Handle httpClient)
{

        long lRetVal = 0;

        instance = TIME;

        HTTPCli_Field fields[4] = {
                                    {HTTPCli_FIELD_NAME_HOST, Time_server},
                                    {HTTPCli_FIELD_NAME_ACCEPT, "*/*"},
                                    {HTTPCli_FIELD_NAME_CONTENT_LENGTH, "0"},
                                    {NULL, NULL}
                                };
        bool        moreFlags;


        /* Set request header fields to be send for HTTP request. */
        HTTPCli_setRequestFields(httpClient, fields);

        /* Send GET method request. */
        /* Here we are setting moreFlags = 0 as there are no more header fields need to send
        at later stage. Please refer HTTP Library API documentaion @ HTTPCli_sendRequest
        for more information.
        */
        moreFlags = 0;
        lRetVal = HTTPCli_sendRequest(httpClient, HTTPCli_METHOD_GET, GET_REQUEST_URI, moreFlags);
        if(lRetVal < 0)
        {
            UART_PRINT("Failed to send HTTP GET request.\n\r");
            return lRetVal;
        }
        MAP_UtilsDelay(0xffff);
        lRetVal = readResponse(httpClient);
        return lRetVal;
}

//*****************************************************************************
//
//! Function to connect to AP
//!
//! \param  none
//!
//! \return Error-code or SUCCESS
//!
//*****************************************************************************
static long ConnectToAP()
{
        int lRetVal = -1;

        //
        // Following function configure the device to default state by cleaning
        // the persistent settings stored in NVMEM (viz. connection profiles &
        // policies, power policy etc)
        //
        // Applications may choose to skip this step if the developer is sure
        // that the device is in its desired state at start of applicaton
        //
        // Note that all profiles and persistent settings that were done on the
        // device will be lost
        //

        // Connecting to WLAN AP - Set with static parameters defined at the top
        // After this call we will be connected and have IP address
        lRetVal = WlanConnect();
        return 0;
}

//*****************************************************************************
//
//! Function to connect to HTTP server
//!
//! \param  httpClient - Pointer to HTTP Client instance
//!
//! \return Error-code or SUCCESS
//!
//*****************************************************************************
static int ConnectToHTTPServer(HTTPCli_Handle httpClient,const char *host_name)
{
        long lRetVal = -1;
        struct sockaddr_in addr;

#ifdef USE_PROXY
        struct sockaddr_in paddr;
        paddr.sin_family = AF_INET;
        paddr.sin_port = htons(PROXY_PORT);
        paddr.sin_addr.s_addr = sl_Htonl(PROXY_IP);
        HTTPCli_setProxy((struct sockaddr *)&paddr);
        #endif
    //    UART_PRINT(Buf);
        /* Resolve HOST NAME/IP */
        lRetVal = sl_NetAppDnsGetHostByName((signed char *)host_name,
        strlen((const char *)host_name),
        &g_ulDestinationIP,SL_AF_INET);
        if(lRetVal < 0)
        {
            ASSERT_ON_ERROR(GET_HOST_IP_FAILED);
        }

        /* Set up the input parameters for HTTP Connection */
        addr.sin_family = AF_INET;
        if (host_name == Time_server)
        {
            addr.sin_port = htons(TIME_PORT);
        }
        if(host_name == soft_layer)
        {
            addr.sin_port = htons(HOST_PORT);
        }

        addr.sin_addr.s_addr = sl_Htonl(g_ulDestinationIP);
        /* Testing HTTPCli open call: handle, address params only */
        HTTPCli_construct(httpClient);
        lRetVal = HTTPCli_connect(httpClient, (struct sockaddr *)&addr, 0, NULL);
        if (lRetVal < 0)
        {
            UART_PRINT("Connection to server failed. error(%d)\n\r", lRetVal);
            ASSERT_ON_ERROR(SERVER_CONNECTION_FAILED);
        }
        else
        {
            UART_PRINT("Connection to server created successfully\r\n");
        }
        return 0;
}



/************************************************************************************************************************/
static void ReadDeviceConfiguration()
{
        unsigned int uiGPIOPort;
        unsigned char pucGPIOPin;
        unsigned char ucPinValue;

        //Read GPIO
        GPIO_IF_GetPortNPin(SH_GPIO_3,&uiGPIOPort,&pucGPIOPin);
        ucPinValue = GPIO_IF_Get(SH_GPIO_3,uiGPIOPort,pucGPIOPin);

        //If Connected to VCC, Mode is AP
        if(ucPinValue == 1)
        {
            //AP Mode
            UART_PRINT("assigning AP role\r\n");
            g_uiDeviceModeConfig = ROLE_AP;
        }
        else
        {
            //STA Mode
            UART_PRINT("assigning STA  role\r\n");
            g_uiDeviceModeConfig = ROLE_STA;
        }

