things-cloud/modbus-implementaion-cc3200/main.c
}
//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************

void construct_post_buffer(int l,int ind)
{
    char *pcBufLocation;
    int temp,i,lRetVal,start_val,end_val;

    switch(l)
    {
    case 1:   start_val = 0;
              end_val = 2;
              break;
  }

    char *temp_str;
    temp_str = (char*)calloc(50,sizeof(char));

    pcBufLocation = post_data;

    strcpy(pcBufLocation,POST_HEADER);
        pcBufLocation += strlen(POST_HEADER);

        strcpy(pcBufLocation , POST_timestamp);
        pcBufLocation += strlen(POST_timestamp);
        strcpy(pcBufLocation , timestamp);
        pcBufLocation += strlen(timestamp);

        strcpy(pcBufLocation , POST_DEVICEID);
        pcBufLocation += strlen(POST_DEVICEID);

        strcpy(pcBufLocation , POST_SLAVE);
        pcBufLocation += strlen(POST_SLAVE);


        strcpy(pcBufLocation,POST_HEADER1);
        pcBufLocation += strlen(POST_HEADER1);

        strcpy(pcBufLocation,POST_BEGIN);
        pcBufLocation += strlen(POST_BEGIN);

    /***************************** phase1 parameters***************************************/


    for (i = start_val;i<end_val;i++)
    {
       temp = Adress[i]-30001;
       temp_index = i;
       Query_set[0]= slave_list[ind];
       Query_set[1] = 0x04;
       Query_set[3] = (char)(temp&0x000000FF);
       Query_set[2] = (char)((temp&0x0000FF00)>>8);
       Query_set[4] = 0x00;
       if((Adress[i]==30002)||(Adress[i]==30004)||(Adress[i]==30006)||(Adress[i]==30038)||(Adress[i]==30040))
       Query_set[5] = 0x02;
       else
       Query_set[5] = 0x01;
       lRetVal = send_validate(Query_set);
       if(lRetVal!=0)
       {
           UART_PRINT("Slave doesn't exist");
           slave_list[0] = 0;
       }
       temp = 0;
       if(i==(end_val-1))
    	   sprintf(temp_str,"\n\"%s\":%d",name_list[i],result);
       else
    	   sprintf(temp_str,"\n\"%s\":%d,",name_list[i],result);
    	   strcpy(pcBufLocation , temp_str);
    	   pcBufLocation += strlen(temp_str);
    }
    /***************************************************************************************/

      sprintf(slave_str,"%d",slave_list[ind]);

            strcpy(pcBufLocation , POST_END);
             pcBufLocation += strlen(POST_END);


            strcpy(pcBufLocation,POST_TAIL1);
            pcBufLocation += strlen(POST_TAIL1);
      free(temp_str);
}




static send_session(int session_no,HTTPCli_Struct httpClient,int ind)
{
    int lRetVal;


    GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);
    construct_post_buffer(session_no,ind);
    UART_PRINT("size of post_data ====== %d\r\n", strlen(post_data));
    sprintf((char *)Post_string_size, "%d", strlen(post_data));
    UART_PRINT(" post data = %s len = %s\r\n", post_data, Post_string_size);


    lRetVal = ConnectToHTTPServer(&httpClient,soft_layer);
      if(lRetVal < 0)
      {
         UART_PRINT("CONNECTION FAILED");
      }

    #ifdef WATCHDOG
    if (IS_CONNECTED(g_ulStatus)) watchdogack();
    #endif
    GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);
    lRetVal = HTTPPostMethod(&httpClient,POST_REQUEST_URI_DC);
    if(lRetVal < 0)
    {
       Mesage("HTTP Post failed.\n\r");
    }

    GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);
    HTTPCli_disconnect(&httpClient);
    HTTPCli_destruct(&httpClient);
    HTTPCli_delete(&httpClient);

}
static void
DisplayBanner(char * AppName)
{
        UART_PRINT("\n\n\n\r");
        UART_PRINT("\t\t *************************************************\n\r");
        UART_PRINT("\t\t      CC3200 %s Application       \n\r", AppName);
        UART_PRINT("\t\t *************************************************\n\r");
        UART_PRINT("\n\n\n\r");
}


//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
        /* In case of TI-RTOS vector table is initialize by OS itself */
        #ifndef USE_TIRTOS
        //
        // Set vector table base
        //
        #if defined(ccs) || defined(gcc)
        MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
        #endif
        #if defined(ewarm)
        MAP_IntVTableBaseSet((unsigned long)&__vector_table);
        #endif
        #endif
        //
        // Enable Processor
        //
        MAP_IntMasterEnable();
        MAP_IntEnable(FAULT_SYSTICK);

        PRCMCC3200MCUInit();
}
void rs485_tristate()
{
    TX_DIS;
    RX_DIS;
}
void rs485_tx_mode()
{
    TX_EN;
    RX_DIS;
}
void rs485_rx_mode()
{
    RX_EN;
    TX_EN;
}
void clear_recv_Buff()
{
    int i;
    for(i = 0;i<20;i++)
    {
        recv_buffer[i] = 0x00;
    }
}
int ModRTU_CRC(char *buf, int len)
{
  int crc = 0xFFFF,temp = 0,pos,i;
  for ( pos = 0; pos < len; pos++) {
    crc ^= (int)buf[pos];          // XOR byte into least sig. byte of crc

    for ( i = 8; i != 0; i--) {    // Loop over each bit
      if ((crc & 0x0001) != 0) {      // If the LSB is set
        crc >>= 1;                    // Shift right and XOR 0xA001
        crc ^= 0xA001;
      }
      else                            // Else LSB is not set
        crc >>= 1;                    // Just shift right
    }

  }
    temp = 0x00FF & crc;
    crc = temp<<8 |crc>>8;

  // Note, this number has low and high bytes swapped, so use it accordingly (or swap bytes)
  return crc;
}
void append_checksum(char* Buf)
{
    int checksum;

    checksum = ModRTU_CRC(Buf,6);
    *(Buf+6) = (char)((checksum&0x0000FF00)>>8);
    *(Buf+7) = (char)(checksum&0x000000FF);
}
void Recv_response()
{
   int i =0;
   char c;
   delay(1000);  // PLAY WITH THIS ALSO TO SEE THE DIFFERENCE
   while(UARTCharsAvail(CONSOLE1) && i<25)
    {
        recv_buffer[i++] = UARTCharGetNonBlocking(CONSOLE1);
    }
    uartRxLength = i;
    recv_buffer[i] = '\0';
    proceed = true;
}
int extract_checksum(char *buf,int len)
{
    int checksum ;
    checksum = *(buf+len-2);
    checksum<<=8;
    checksum = checksum|(*(buf+len-1));
    return checksum;
}
void send_cmd(char term,char *Buf,int len)
{
    int i;
    char c;
    if(term == Debug)
    {
        for (i=0;i<len;i++)
                {
                    MAP_UARTCharPut(CONSOLE,Buf[i]);
                }
    }else
    {
        while(UARTCharsAvail(CONSOLE1))
          {
              c = UARTCharGetNonBlocking(CONSOLE1);
          }
        for (i=0;i<len;i++)
                {
                    MAP_UARTCharPut(CONSOLE1,Buf[i]);
                }
        while(MAP_UARTBusy(UARTA1_BASE));
    }

