things-cloud/modbus-implementaion-cc3200/main.c
}
int send_validate(char* Buf)
{
    static int i=0;
    int check_sum,calc_checksum,ret_val;
     result = 0;

    append_checksum(Buf);
    clear_recv_Buff();

    delay(100);
    send_cmd(Slave,Buf,8);

    delay(10000);
    check_sum = extract_checksum(recv_buffer,uartRxLength);
    calc_checksum = ModRTU_CRC(recv_buffer,uartRxLength-2);
    if(check_sum == calc_checksum)
    {
        if(recv_buffer[0] == Buf[0] && recv_buffer[1]==Buf[1])
        {
            GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
            if((Adress[temp_index]==30002)||(Adress[temp_index]==30004)||(Adress[temp_index]==30006)||(Adress[temp_index]==30038)||(Adress[temp_index]==30040))
            {
            	result |= recv_buffer[3];
            	result = ((result<<8)|recv_buffer[4]);
            	result = ((result<<8)|recv_buffer[5]);
            	result = ((result<<8)|recv_buffer[6]);
            }
            else
            {	result |= recv_buffer[3];
                result = ((result<<8)|recv_buffer[4]);
            }
            i=0;
            return 0;
        }else
        {
            GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
            return 2;
        }
    }else{
        i++;

          if(i == 2)
          {
              i = 0;
              GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
              return 1;
          }
        ret_val =send_validate(Buf);
        if(ret_val == 0)
        {
            i = 0;
            return 0;
        }
    }
}

void  Get_slave_ids()
{
    int i;

    int ret_val,s;
    char Test_Query[8] = {0x03,0x04,0x00,0x00,0x00,0x01};
   s=0;
  for(i = 1;i<10;i++)
    {
        Test_Query[0] = (char)i;
        ret_val = send_validate(Test_Query);
#ifdef WATCHDOG
watchdogack();
#endif
        if(ret_val == 0)
        {
            slave_list[s] = i;
            UART_PRINT("slave found %d",i);
            s++;

        }
        UART_PRINT("%d",i);
    }
    no_of_slaves = s;

}

static void Uart1IntHandler(void)
{

    Recv_response();
    MAP_UARTIntClear(UARTA1_BASE,UART_INT_RX);
}


int main()
{
        long lRetVal = -1;
        //HTTPCli_Struct httpClient;
        unsigned long ulResetCause;
        static int ind;

        //
        // Board Initialization
        //
        BoardInit();

        //
        // Configure the pinmux settings for the peripherals exercised
        //
        PinMuxConfig();
        PinConfigSet(PIN_58,PIN_STRENGTH_2MA|PIN_STRENGTH_4MA,PIN_TYPE_STD_PD);
        //
        // Configuring UART
        //
        UDMAInit();
        uart_init();
        GPIO_IF_LedConfigure(LED1|LED2|LED3);
        ulResetCause = PRCMSysResetCauseGet();

        //
        // If watchdog triggered reset request hibernate
        // to clean boot the system
        //
        if( ulResetCause == PRCM_WDT_RESET )
        {
            HIBEntrePreamble();
            MAP_PRCMOCRRegisterWrite(0,1);
            MAP_PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);
            MAP_PRCMHibernateIntervalSet(330);
            MAP_PRCMHibernateEnter();
        }

        GPIO_IF_LedOff(MCU_ALL_LED_IND);
        //
        // Display banner
        //
        DisplayBanner(APP_NAME);
        if( ulResetCause == PRCM_HIB_EXIT &&  (MAP_PRCMOCRRegisterRead(0) & 1) == 1 )
           {
               UART_PRINT("Reset Cause        : Watchdog Reset\n\r");
           }
           else
           {
               UART_PRINT("Reset Cause        : Power On\n\r");
           }
        ReadDeviceConfiguration();
        HTTPCli_Struct httpClient;
        HTTPCli_Struct httpClient1;
        if (g_uiDeviceModeConfig == ROLE_AP)
        {
            s=1;
            WlanAPMode();
        }
        else
        {
#ifdef WATCHDOG
            WDT_IF_Init(watchdogIntHandler, MILLISECONDS_TO_TICKS(WD_PERIOD_MS));
#endif
            lRetVal = ConfigureSimpleLinkToDefaultState();
            if(lRetVal < 0)
            {
                if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
                {
                    UART_PRINT("Failed to configure the device in its default state, "
                    "Error-code: %d\n\r", DEVICE_NOT_IN_STATION_MODE);
                }
                return -1;
            }

            UART_PRINT("Simple link configured to default state\n");


            lRetVal = ConnectToAP();
            if(lRetVal < 0)
            {
                LOOP_FOREVER();
            }
            Get_slave_ids();
            s=1;
            while(1)
            {

               #ifdef WATCHDOG
                           if (IS_CONNECTED(g_ulStatus)) watchdogack();
               #endif
                   GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);


                   lRetVal = ConnectToHTTPServer(&httpClient1,Time_server);
                   if(lRetVal < 0)
                   {
                       UART_PRINT("CONNECTION FAILED");

                   }
                   GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);
               #ifdef WATCHDOG
                           if (IS_CONNECTED(g_ulStatus)) watchdogack();
               #endif

                   lRetVal = HTTPGetMethod(&httpClient1);
                   if(lRetVal < 0)
                   {
                       UART_PRINT("HTTP  Get failed.\n\r");
                   }
                   GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);


               #ifdef WATCHDOG
                           if (IS_CONNECTED(g_ulStatus)) watchdogack();
               #endif
                   HTTPCli_disconnect(&httpClient1); //for timestamp
                   HTTPCli_destruct(&httpClient1);
                   HTTPCli_delete(&httpClient1);
                  send_session(1,httpClient,ind);

       #ifdef WATCHDOG
                   if (IS_CONNECTED(g_ulStatus)) watchdogack();
       #endif
                   GPIO_IF_LedToggle(MCU_ORANGE_LED_GPIO);


                   ind++;
                   if(ind >= no_of_slaves)
                   {
                       ind = 0;
                       delay(9000);
                       delay(9000);
                       delay(9000);
                   }
                   GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
                   GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);

#ifdef WATCHDOG
            WDT_IF_DeInit();
#endif
            }
        }
}
void uart_init()
{
    MAP_UARTConfigSetExpClk(UARTA1_BASE,MAP_PRCMPeripheralClockGet(PRCM_UARTA1),
                        9600, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                                   UART_CONFIG_PAR_NONE));
     MAP_UARTFIFOEnable(UARTA0_BASE);
     MAP_UARTFIFOLevelSet (UARTA0_BASE,UART_FIFO_TX4_8,UART_FIFO_RX4_8 );
     InitTerm();
     MAP_UARTFlowControlSet(UARTA1_BASE, UART_FLOWCONTROL_TX);
     MAP_UARTFIFOEnable(UARTA1_BASE);
     MAP_UARTFIFOLevelSet (UARTA1_BASE,UART_FIFO_TX4_8,UART_FIFO_RX1_8);
     MAP_UARTIntRegister(UARTA1_BASE, Uart1IntHandler);
     MAP_UARTIntEnable(UARTA1_BASE,UART_INT_RX);

}
